export const testsList = {
    test1: [
        {
            question: 'Як називається основний закон електроніки?',
            answer: [
                'Вольта',
                'Ома',
                'Ампера',
                'Піфагора'
            ],
            numberOfRightAnswer: 2
        },
        {
            question: 'При послідовному з\'єднанні загальний струм…',
            answer: [
                'дорівнює сумі струмів , що йдуть через кожний провідник',
                'однаковий на всіх провідниках',
                '3може бути різним в усіх провідників'
            ],
            numberOfRightAnswer: 2
        },
        {
            question: 'При паралельному з\'єднанні напруга…',
            answer: [
                'однакова на всіх резисторах',
                'на різних резисторах може бути різною',
                'загальна напруга дорівнює сумі напруг на всіх резисторах'
            ],
            numberOfRightAnswer: 1
        },
        {
            question: 'При послідовному з\'єднанні резисторів загальний опір дорівнює…',
            answer: [
                'сумі обернених величин опорів',
                'сумі опорів резисторів ',
                'середньому арифметичному опорів'
            ],
            numberOfRightAnswer: 2
        },
        {
            question: 'Яка електрична величина при послідовному з\'єднанні є сталою для всіх споживачив?',
            answer: [
                'опір',
                'струм',
                'напруга'
            ],
            numberOfRightAnswer: 2
        },
        {
            question: 'Як з\'єднані три елементи у кишеньковому ліхтарику?',
            answer: [
                'послідовно',
                'паралельно',
                'довільно'
            ],
            numberOfRightAnswer: 1
        },
        {
            question: 'Напруга при послідовному з\'єднанні провідників…',
            answer: [
                'на всіх ділянках однакова',
                'дорівнює сумі напруг на окремих ділянках кола',
                'дорівнює напрузі на першому провіднику'
            ],
            numberOfRightAnswer: 2
        },
        {
            question: 'Чому дорівнює загальний опір електричного кола, в якому з\'єднано паралельно дві лампочки, що мають опір 15 Ом і 10 Ом?',
            answer: [
                '16 Ом',
                '225 Ом',
                '30,167 Ом'
            ],
            numberOfRightAnswer: 2
        },
        {
            question: 'При якому з\'єднанні двох резисторів їхній опір менший, ніж опір кожного зокрема?',
            answer: [
                'такого не може бути',
                'паралельному',
                'послідовному'
            ],
            numberOfRightAnswer: 2
        }
    ]
}