import React, {Component} from 'react'
import {Link} from "react-router-dom";

export default  class Lecture extends Component {
    render() {
        return (
            <div className='lecture'>
                <div>
                    <h1>Вас вітає бортовий комп'ютер ЕР-К-Р.1970</h1>
                    <h1>Вхідна лекція. Задачі та етапи розвитку Схемотехніки</h1>
                    <p>
                        Схемотехніка є спадкоємницею технічної електроніки і її задачею є ство-рення пристроїв і
                        приладів для перетворення електромагнітної енергії, пере-давання, оброблення та зберігання
                        інформації. Внаслідок досягнень схемо-техніки промисловість випускає радіоелектронну
                        апаратуру (РЕА) для зв’язку, автоматики, телебачення, радіолокації, навігації,
                        обчислювальної техніки, систем керування технологічними процесами, світлотехніки,
                        інфрачервоної техніки, рентгенотехніки тощо.
                        Весь період розвитку схемотехніки можна поділити на чотири нступних покоління: <br/>
                        – схемотехніка на електровакуумних електронних приладах;<br/>
                        – схемотехніка на напівпровідникових приладах;<br/>
                        – схемотехніка на інтегральних мікросхемах;<br/>
                        – схемотехніка на функціональних вузлах.<br/>
                        Перше покоління схемотехніки зв’язку починається з 1896 р., тобто часу винаходу російським
                        вченим О.С. Поповим радіо. У зв’язку з цим постала задача детектування високочастотних коливань.
                        Для цього англійський вчений Д.А.Флемінг запропонував використання явища термоелектронної
                        емісії, яку відкрито в 1884 р. Т.А.Едісоном. На її базі в 1906 р. Д.А.Флемінг винайшов перший
                        електронний прилад з односторонньою провідністю – двоелектродну лампу з термокатодом (діод). Для
                        підвищення потужності діода в 1905 р. А.Хелл у США винайшов газонаповнений діод (газотрон).
                        <br/>Тоді ж виникла задача підсилення коливань, без чого не міг існувати радіоприймач. Для цього
                        в 1907 р. американський інженер Лі де Форест увів у діод між катодом та анодом третій електрод –
                        керуючу сітку, створивши саме тим підсилювальну триелектродну лампу – тріод. Підсилювачі на
                        цьому приладі знайшли саме широке розповсюдження серед пристроїв на електровакуумних приладах, а
                        керуюча сітка для підсилення назавжди залишилася не тільки в тріоді, а й в інших
                        багатоелектродних лампах.
                        <br/>У 1907 р. професор Петербурзького технологічного інституту Б.Л.Розінг запропонував
                        використання електронно-проміневої трубки для приймання зображень, поклавши саме тим початок
                        телебаченню.
                        <br/>Розвиток підсилювальної схемотехніки на тріодах і просування підсилю-вачів в область вищих
                        частот висунули нові вимоги до удосконалення елект-ронних ламп.
                        <br/>Для підвищення верхньої межі частот підсилення в 1915 р. німецький фізик В.Шотткі винайшов
                        чотириелектродну лампу (тетрод) з екрануючою сіткою. Підсилювачі на тетродах хоча й опанували
                        вищі частоти, але не забезпечували якість підсилення через спотворення, які зумовлені так званим
                        динатронним ефектом. Тому А. Хелл у США почав удосконалення екранованих ламп і в 1930 р.
                        запропонував п’ятиелектродну лампу (пентод), підсилювачі на якої стали самими розповсюдженими.
                        <br/>Поруч з розвитком електронної підсилювальної техніки постала задача приймання світла. Для
                        цього в 1930 р. Л.А.Кубецький в СРСР винайшов фотоелектронний помножувач. Цей прилад деякий час
                        був приймачем зображень у телебаченні. У той самий час розвиток телебачення вимагав створення не
                        тільки приймальної техніки зображень, але й передавальної. Тому справжнім поштовхом розвитку
                        телебачення з’явилась пропозиція О.П. Констянтинова і С.І. Катаєва (СРСР) зі створення
                        спеціальних передавальних телевізійних трубок (іконоскопів). Аналогічні трубки створив у США
                        російський емігрант В.К.Зворикін. У 1933 р. П.В. Шмаков і П.В. Тимофєєв (СРСР) запропонували
                        передавальні телевізійні трубки з підвищеною чутливістю – суперіконоскопи, а в 1939 р.
                        Г.В.Брауде (СРСР) висловив ідею створення суперортікона – най-чутливішої передавальної
                        телевізійної трубки.
                        <br/>Разом із розробкою низькочастотної електронної техніки почалося освоє-ння схемотехніки
                        надвисоких частот (НВЧ). Так у 1932 р. радянський вчений Д.А. Рожанський запропонував динамічне
                        керування електронним потоком з метою використати час прольоту електронів між електродами за
                        корисне явище для підвищення верхньої частотної межі. На підставі цієї пропозиції А.Н.Арсеньєва
                        і О. Хейль (СРСР) у 1939 р. створили прилади для генерування та підсилення коливань НВЧ. У 1940
                        р. В.Ф. Коваленко винайшов відбивальний клістрон – генератор НВЧ, який використовується і
                        сьогодні.
                        <br/>Незважаючи на бурхливий розвиток лампової техніки, починаються пошуки більш надійних,
                        економічних, довговічних та малогабаритних приладів і пристроїв.
                        <br/>Так у 1922 р. інженер Нижегородської лабораторії О.В. Лосєв відкрив можливість генерування
                        й підсилення електричних коливань за допомогою кришталевого (напівпровідникового) детектора. Ним
                        же відкрито явище світіння контакту “метал-напівпровідник”, тобто О.В. Лосєв вперше створив
                        світлодіод. На превеликий жаль роботи О.В. Лосєва не знайшли визнання в СРСР.
                        <br/>Народження схемотехніки другого покоління припадає на 1948 рік, коли американські
                        дослідники Д. Бардін, У. Браттейн і У. Шоклі винайшли напівпровідниковий тріод (транзистор). З
                        цього моменту почався бурхливий розвиток напівпровідникової схемотехніки. Сьогодні
                        напівпровідникова схемо-техніка повністю витіснила електронні лампи з приймально-підсилювальної
                        апаратури, інформаційно-вимірювальної техніки, приладів обчислювальної техніки тощо. З’явилася
                        можливість реалізації складних функцій, які були неприступні для лампової схемотехніки через
                        велику енергоємність, громізд-кість та низьку надійність.
                        <br/>Однак і в схемотехніці другого покоління мініатюрність, енергоспожи-вання й надійність
                        швидко вичерпали межі можливостей.
                        <br/>Пояснимо це прикладом.
                        <br/>Нехай треба створити компактний електронний пристрій, який містить 106 компонентів зі
                        середньою потужністю 15 мВт, середньою масою 0,5 г, середнім об’ємом 1 см3 та ймовірністю
                        відмови 10-5(год)-1. Результат буде наступним:
                        <br/>– потужність, яка розсіюється у середині пристрою становитиме 15 кВт;
                        <br/>– об’єм досягне 1 м3;
                        <br/>– маса дорівнюватиме 500 кг;
                        <br/>– середня частота відмов досягне 10 (год)-1, тобто 10 разів за годину.
                        <br/>Як бачимо, пристрій є далеко не компактним, з недопустимою потуж-ністю розсіювання і, саме
                        головне, непрацездатним, бо відмовляє 10 разів за годину.
                        <br/>З урахуванням того, що сучасні електронні пристрої складніші набагато порядків, стане
                        зрозумілою неможливість їхнього створення засобами дискрет-ної транзисторної техніки.
                        <br/>Третє покоління схемотехніки, яке зародилося наприкінці 50-х років минулого століття, має
                        за мету вирішувати такі задачі на якісно нових засадах, які забезпечують зменшення на декілька
                        порядків габаритів, енергоспоживання, вартості й частоти відмов. Саме такими елементами стали
                        інтегральні мікросхеми (ІМС). Технологія їхнього виготовлення дає можливість в мікрооб’ємах
                        твердого тіла створювати електронні пристрої, які містять надто значну кількість компонентів
                        (транзисторів, діодів, резисторів тощо). Тоді розробник РЕА отримує ІМС, яка є готовим
                        функціональним вузлом у вигляді конструктивного єдиного електронного приладу, наприклад,
                        підсилювача, лічильника імпульсів, шифратора, дешифратора і навіть ЕОМ.
                        <br/>Саме завдяки наявності ІМС маємо, зокрема, сучасну систему зв’язку, де комп’ютерна техніка
                        є не "великим арифмометром", а технічним засобом.
                        <br/>Появу серед ІМС мікро-ЕОМ слід було б також виділити в одне з поколінь, бо схемотехніка на
                        мікро-ЕОМ дає принципово нові невідомі раніш можливості. Наприклад, підсилення можна здійснити
                        помноженням цифрової копії сигналу на постійне число, але при цьому, на відміну від підсилювача,
                        не виникають нелінійні, частотні й фазові спотворення, не виникає небезпека самозбудження при
                        високому підсиленні, не вносяться шуми, нема чому відмовляти щодо підсилення тощо.
                        <br/>Розвиток схемотехніки на мікро-ЕОМ і ЕОМ у цілому ще себе не вичерпали і є вдячною задачею.
                        <br/>Четверте покоління складають функціональні мікросхеми, прилади та вузли, в яких важко або
                        неможливо виділити традіційні компоненти (транзис-тори, діоди, резистори, конденсатори тощо).
                        Тут здійснюється інтеграція різноманітних об’ємних та поверхніх явищ. Наслідком може бути
                        подолання бар’єру складності. Це покоління знаходиться у початковому стані розробки і ще не
                        вийшло за межі лабораторій.

                    </p>
                </div>
                <Link to="/test">
                    <h1>Перейти до тесту</h1>
                </Link>
            </div>
        )
    }
}